Repository: xccui/SPWAF-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: "path/to/jarFile.jar") // JAR file to ship to the JobManager
zh_cn: "path/to/jarFile.jar") // 需要传输到JobManager的JAR包

source: # Binary metadata file of a savepoint
zh_cn: # 某一保存点的二进制元数据文件

source: # Checkpointed operator states
zh_cn: # 存储的算子状态

source: # Isolates Flink from other frameworks using the ZooKeeper cluster.
zh_cn: # 将Flink和其他使用ZooKeeper集群的框架进行隔离。

source: # Isolates multiple Flink clusters from each other.
zh_cn: # 将多个Flink集群相互隔离。

source: # Must be less or equal to the configured maximum number of attempts.
zh_cn: # 该值必须小于或等于配置的最大尝试次数。

source: # Path of a particular savepoint
zh_cn: # 某一具体保存点的路径

source: # RECOMMENDED: set the base path for all Flink clusters in ZooKeeper.
zh_cn: # 建议参数：在ZooKeeper中为全部Flink集群设置基础路径。

source: # RECOMMENDED: set the path for the Flink cluster in ZooKeeper.
zh_cn: # 建议参数：在ZooKeeper中为Flink集群设置路径

source: # REQUIRED: enable HA mode via ZooKeeper high-availability: zookeeper
zh_cn: # 必填参数：通过ZooKeeper开启HA模式 high-availability: zookeeper

source: # REQUIRED: provide a list of all ZooKeeper servers of the quorum high-availability.zookeeper.quorum: address1:2181[,...],addressX:2181
zh_cn: # 必填参数：提供ZooKeeper Quorum的服务器列表 high-availability.zookeeper.quorum: address1:2181[,...],addressX:2181

source: # REQUIRED: set storage location for job metadata in remote storage high-availability.storageDir: hdfs:///flink/recovery
zh_cn: # 必填参数：设置作业元数据的远程存储位置 high-availability.storageDir: hdfs:///flink/recovery

source: # Restart an application at most 3 times (+ the initial start).
zh_cn: # 应用最多重启3次（包括首次启动）。

source: # Savepoint root path
zh_cn: # 保存点根路径

source: # The cluster id is required to look up the metadata of a failed cluster.
zh_cn: # 集群ID是查找故障集群元数据的必要信息。

source: ${FLINK_IMAGE_NAME}: The name of the job-specific image.
zh_cn: ${FLINK_IMAGE_NAME}：特定作业镜像的名称。

source: ${FLINK_JOB_PARALLELISM}: The degree of parallelism for the job.
zh_cn: ${FLINK_JOB_PARALLELISM}：作业的并行度。

source: ${FLINK_JOB}: The main class of the job to start.
zh_cn: ${FLINK_JOB}：用于启动作业的主类。

source: ("sensor_2", 10 * 1000L), // forward sensor_2 for 10 seconds
zh_cn: ("sensor_2", 10 * 1000L), // sensor_2转发10秒

source: ("sensor_7", 60 * 1000L)) // forward sensor_7 for 1 minute
zh_cn: ("sensor_7", 60 * 1000L)) // sensor_7转发1分钟

source: (See “Modifying the State of an Operator”.)
zh_cn: （见"修改算子的状态"一节。）

source: (TumblingEventTimeWindows.of(size)) or for window.(TumblingProcessing TimeWindows.of(size)) depending on the configured time characteristic.
zh_cn: 具体调用那个方法取决于配置的时间特性。

source: (enabled by default) and limit the size of state (5 MB by default):
zh_cn: 可以通过接收参数来决定是否开启异步检查点（默认开启）及限制状态大小（默认5MB）：

source: (fs.<scheme>.limit.timeout) and how long to wait until an idle connection is closed (fs.<scheme>.limit.stream-timeout).
zh_cn: 超时参数可用来控制连接请求失败前的等待时间（fs.<schema>.limit.timeout）以及空闲连接关闭的等待时间（fs.<scheme>.limit.stream-timeout）。

source: (more on this in “Checkpoints, Savepoints, and State Recovery” on page 58), RocksDBStateBackend is a good choice for applications with very large state.
zh_cn: 所以对于状态非常大的应用是一个很好的选择。

source: (temporary inconsistencies
zh_cn: （故障恢复过程中会有临时性不一致）

source: * first results and updates.
zh_cn: * 会区分首次结果和后续更新。

source: * monotonically increases for 1 second (in processing time).
zh_cn: * 则发出警告。

source: * re-directs them to a side output */
zh_cn: * 并将其重定向到副输出的ProcessFunction */

source: * to the target directory.
zh_cn: * 来提交事务。

source: * with a temperature below 32F.
zh_cn: * 向副输出发送冻结警报。

source: * written.
zh_cn: * 临时文件。

source: .between(<lower-bound>, <upper-bound>) // bounds with respect to input1
zh_cn: .between(<lower-bound>, <upper-bound>) // 相对于input1的上下界

source: .equalTo(...) // specify key attributes for input2
zh_cn: .equalTo(...) // 为input2指定键值属性

source: .keyBy(0) // key on first field of the tuple
zh_cn: .keyBy(0) // 以元组第一个字段为键值进行分区

source: .keyBy(0, 0) // key both input streams on first attribute
zh_cn: .keyBy(0, 0) // 两个数据流都以第一个属性作为键值

source: .process(ProcessJoinFunction) // process pairs of matched events
zh_cn: .process(ProcessJoinFunction) // 处理匹配的事件对

source: .reduce/aggregate/process(...) // specify the window function
zh_cn: .reduce/aggregate/process(...) // 指定窗口函数

source: .where(...) // specify key attributes for input1
zh_cn: .where(...) // 为input1指定键值属性

source: .window(...) // specify the WindowAssigner [.trigger(...)] // optional: specify a Trigger [.evictor(...)] // optional: specify an Evictor
zh_cn: .window(...) // 指定WindowAssigner [.trigger(...)] // 选择性地指定Trigger [.evictor(...)] // 选择性地指定Evictor

source: /** A ProcessFunction that filters out late sensor readings and
zh_cn: /** 用于过滤出迟到的传感器读数

source: /** A counting WindowProcessFunction that distinguishes between
zh_cn: /** 用于计数的WindowProcessFunction，

source: /** A custom window that groups events into 30-second tumbling windows.
zh_cn: /** 将事件按照每30秒滚动窗口进行分组的自定义窗口。

source: /** A trigger that fires early.
zh_cn: /** 可提前触发的触发器。

source: /** Aborts a transaction by deleting the transaction file.
zh_cn: /** 通过删除事务文件来终止事务。

source: /** Commit a transaction by moving the precommitted transaction file
zh_cn: /** 通过将预提交的事务文件移动到目标目录

source: /** Creates a temporary file for a transaction into which the records are
zh_cn: /** 为写入记录的事务创建一个

source: /** Emits a warning if the temperature of a sensor
zh_cn: /** 如果某传感器的温度在1秒（处理时间）内持续增加

source: /** Emits freezing alarms to a side output for readings
zh_cn: /** 对于温度低于32F的读数

source: /** Flush and close the current transaction file.
zh_cn: /** 强制写出文件内容并关闭当前事务文件。

source: /** Write record into the current transaction file.
zh_cn: /** 将记录写入当前事务文件中。

source: // 1 min in ms
zh_cn: // 1分钟的毫秒数

source: // A context object that is given to Evictor methods.
zh_cn: // 用于移除器内方法的上下文对象。

source: // A context object that is given to Trigger methods to allow them
zh_cn: // 用于触发器中方法的上下文对象

source: // A context that gives access to the current processing time
zh_cn: // 用于访问当前处理时间的上下文

source: // An AggregateFunction to compute the average tempeature per sensor.
zh_cn: // 用于计算每个传感器平均温度的AggregateFunction。

source: // Called for every element that gets added to a window
zh_cn: // 每当有元素添加到窗口中时都会调用

source: // Called when a processing-time timer fires public abstract TriggerResult onProcessingTime( long timestamp, W window, TriggerContext ctx);
zh_cn: // 在处理时间计时器触发时调用 public abstract TriggerResult onProcessingTime( long timestamp, W window, TriggerContext ctx);

source: // Called when an event-time timer fires
zh_cn: // 在事件时间计时器触发时调用

source: // Called when several windows have been merged into one window
zh_cn: // 当多个窗口合并为一个窗口

source: // CheckpointCommitter that commits checkpoints to the local filesystem
zh_cn: // 将检查点对应的数据写入本地文件系统的CheckpointCommitter

source: // Clears any state that the trigger might hold for the given window
zh_cn: // 在触发器中清除那些为给定窗口保存的状态

source: // Connections and prepared statements should be cached.
zh_cn: // 你应该对连接和预编译语句进行缓存。

source: // Continue.
zh_cn: // 继续。

source: // Creating a new connection and statement for each record.
zh_cn: // 为每条记录创建一个新的连接及语句。

source: // DataStream of Tuple2[String, Integer] for Person(name, age) val persons: DataStream[(String, Integer)] = env.fromElements( ("Adam", 17),
zh_cn: // DataStream的类型Tuple2[String, Integer]表示Person(name, age) val persons: DataStream[(String, Integer)] = env.fromElements( ("Adam", 17),

source: // Deletes a processing-time timer
zh_cn: // 删除一个处理时间计时器

source: // Deletes an event-time timer
zh_cn: // 删除一个事件时间计时器

source: // Deletes any custom per-window state when the window is purged
zh_cn: // 在窗口清除时删除自定义的单个窗口状态

source: // Emits a record to the side output identified by the OutputTag.
zh_cn: // 向OutputTag标识的副输出发送记录。

source: // Enable externalized checkpoints cpConfig.enableExternalizedCheckpoints( ExternalizedCheckpointCleanup.RETAIN_ON_CANCELLATION)
zh_cn: // 启用外化检查点 cpConfig.enableExternalizedCheckpoints( ExternalizedCheckpointCleanup.RETAIN_ON_CANCELLATION)

source: // Evaluates the window
zh_cn: // 对窗口执行计算

source: // Extension of TriggerContext that is given to the Trigger.onMerge() method
zh_cn: // 用于Trigger.onMerge()方法的TriggerContext扩展

source: // IN1: the type of the first input stream
zh_cn: // IN1：第一条输入流的类型

source: // IN2: the type of the second input stream
zh_cn: // IN2：第二条输入流的类型

source: // IN: the type of the split elements OutputSelector[IN]
zh_cn: // IN：拆分流的元素类型 OutputSelector[IN]

source: // Indicates whether this assigner creates event-time windows
zh_cn: // 表明此分配器是否创建基于事件时间的窗口

source: // KEY: the type of the key KeySelector[IN, KEY]
zh_cn: // KEY：键值类型 KeySelector[IN, KEY]

source: // Merges per-window state of the trigger
zh_cn: // 合并触发器中的单个窗口状态

source: // Note: This is NOT best practice!
zh_cn: // 注意：实际应用中不要这么做！

source: // O: the type of output elements FlatMapFunction[T, O]
zh_cn: // O：输出元素的类型 FlatMapFunction[T, O]

source: // O: the type of output elements MapFunction[T, O]
zh_cn: // O：输出元素的类型 MapFunction[T, O]

source: // OUT: the type of the output elements CoFlatMapFunction[IN1, IN2, OUT]
zh_cn: // OUT：输出元素的类型 CoFlatMapFunction[IN1, IN2, OUT]

source: // OUT: the type of the output elements CoMapFunction[IN1, IN2, OUT]
zh_cn: // OUT：输出元素的类型 CoMapFunction[IN1, IN2, OUT]

source: // Optionally evicts elements.
zh_cn: // 选择性地移除元素。

source: // Random JobID used by the CheckpointCommitter
zh_cn: // 用于CheckpointCommitter的随机JobID

source: // Registers a processing-time timer
zh_cn: // 注册一个处理时间计时器

source: // Registers an event-time timer
zh_cn: // 注册一个事件时间计时器

source: // Retrieves a state object that is scoped to the window and the key of the trigger
zh_cn: // 获取一个作用域为触发器键值和当前窗口的状态对象

source: // Returns a collection of windows to which the element is assigned
zh_cn: // 返回元素分配的目标窗口集合

source: // Returns the TypeSerializer for the windows of this WindowAssigner public abstract TypeSerializer<W> getWindowSerializer( ExecutionConfig executionConfig);
zh_cn: // 返回WindowAssigner中窗口的TypeSerializer public abstract TypeSerializer<W> getWindowSerializer( ExecutionConfig executionConfig);

source: // Returns the current event time watermark.
zh_cn: // 返回当前事件时间水位线。

source: // Returns the current event-time watermark
zh_cn: // 返回当前事件时间水位线

source: // Returns the current processing time
zh_cn: // 返回当前处理时间

source: // Returns the current processing time.
zh_cn: // 返回当前处理时间。

source: // Returns the current watermark time
zh_cn: // 返回当前水位线时间

source: // Returns the default Trigger of the WindowAssigner public abstract Trigger<T, W> getDefaultTrigger( StreamExecutionEnvironment env);
zh_cn: // 返回WindowAssigner的默认触发器 public abstract Trigger<T, W> getDefaultTrigger( StreamExecutionEnvironment env);

source: // Returns the metadata of the window
zh_cn: // 返回窗口的元数据

source: // Returns true if this trigger supports merging of trigger state
zh_cn: // 如果触发器支持合并触发器状态则返回true

source: // Scala object that defines the DataStream program in the main() method.
zh_cn: // Scala对象，其main()方法中定义了DataStream程序

source: // Serializer for records
zh_cn: // 记录的序列化器

source: // State accessor for per-key global state
zh_cn: // 用于每个键值全局状态的访问器

source: // State accessor for per-window state
zh_cn: // 用于单个窗口状态的访问器

source: // T: the element type ReduceFunction[T]
zh_cn: // T：元素类型 ReduceFunction[T]

source: // T: the type of elements FilterFunction[T]
zh_cn: // T：元素类型 FilterFunction[T]

source: // T: the type of input elements
zh_cn: // T：输入元素的类型

source: // The FileInputFormat "hdfs:///path/to/my/data", // The path to read
zh_cn: // FileInputFormat "hdfs:///path/to/my/data", // 读取路径

source: // The accumulator holds the sum of temperatures and an event count.
zh_cn: // 累加器用于保存温度总和及事件数量。

source: // The context holding window metadata
zh_cn: // 保存窗口元数据的上下文

source: // The monitoring interval in ms
zh_cn: // 以毫秒为单位的监控间隔

source: // The processing mode
zh_cn: // 处理模式

source: // The state to be merged must support merging
zh_cn: // 目标状态自身需要支持合并

source: // This method is called when a window is purged
zh_cn: // 该方法会在清除窗口时调用

source: // TypeInformation for Java Tuples TypeInformation<Tuple2<Long, String>> tupleType = Types.TUPLE(Types.LONG, Types.STRING);
zh_cn: // Java元组的TypeInformation TypeInformation<Tuple2<Long, String>> tupleType = Types.TUPLE(Types.LONG, Types.STRING);

source: // TypeInformation for POJOs
zh_cn: // POJO的TypeInformation

source: // TypeInformation for Scala Tuples
zh_cn: // Scala元组的TypeInformation

source: // TypeInformation for case classes
zh_cn: // 样例类的TypeInformation

source: // TypeInformation for primitive types
zh_cn: // 原始类型的TypeInformation

source: // a filter lambda function that checks if tweets contains the word "flink"
zh_cn: // 用于检查是否包含"flink"一词的过滤器lambda函数

source: // add an input element to the accumulator and return the accumulator.
zh_cn: // 向累加器中添加一个输入元素并返回累加器。

source: // add current cnt
zh_cn: // 添加当前的cnt

source: // all of Flink's built-in backends are configurable
zh_cn: // 所有Flink内置的状态后端都是可配置的

source: // allow three checkpoint to be in progress at the same time
zh_cn: // 允许同时生成三个检查点

source: // alternative: connect two keyed streams
zh_cn: // 或者是联结两个已经按键值分好区的数据流

source: // and the state of the triggers needs to be merged
zh_cn: // 且需要合并触发器状态时调用

source: // apply ProcessFunction to monitor temperatures
zh_cn: // 使用KeyedProcessFunction来监测温度

source: // apply a stateful FlatMapFunction on the keyed stream which
zh_cn: // 在键值分区数据流上应用一个状态化的FlatMapFunction

source: // apply filtering CoProcessFunction
zh_cn: // 应用过滤CoProcessFunction

source: // apply result handling callback on the room future
zh_cn: // 对房间Future对象应用结果处理回调

source: // assign record timestamp
zh_cn: // 为记录分配时间戳

source: // assign timestamps and generate watermarks
zh_cn: // 分配时间戳并生成水位线

source: // assign timestamps and watermarks (required for event time)
zh_cn: // 分配时间戳和水位线（事件时间所需)

source: // assume local setup and TM runs on same machine as client
zh_cn: // 假设使用本地模式，TM和客户端运行在相同机器上

source: // at most 100 concurrent requests
zh_cn: // 最多100个并发请求

source: // both fields are public public String name; public int age;
zh_cn: // 两个字段都是公有类型 public String name; public int age;

source: // broadcast second input stream
zh_cn: // 将第二条输入流广播

source: // broker list
zh_cn: // Kafka Broker列表

source: // build Flink for a Hadoop version of a distributor mvn clean install -DskipTests -Pvendor-repos \
zh_cn: // 针对某一发行商版本的Hadoop构建Flink mvn clean install -DskipTests -Pvendor-repos \

source: // build Flink for a specific official Hadoop version mvn clean install -DskipTests -Dhadoop.version=2.6.1
zh_cn: // 针对某一特定官方版本的Hadoop构建Flink mvn clean install -DskipTests -Dhadoop.version=2.6.1

source: // caching execution context used to handle the query threads private lazy val cachingPoolExecCtx = ExecutionContext.fromExecutor(Executors.newCachedThreadPool())
zh_cn: // 缓存用于处理查询线程的执行环境 private lazy val cachingPoolExecCtx = ExecutionContext.fromExecutor(Executors.newCachedThreadPool())

source: // can be looked up in logs of running job or the web UI
zh_cn: // 可以通过运行作业的日志或Web UI获取

source: // check if temperature is high
zh_cn: //检查温度是否过高

source: // check if the file exists to ensure that the commit is idempotent
zh_cn: // 检查目标文件是否存在以保证提交的幂等性

source: // check if we have a threshold
zh_cn: // 检查阈值是否已经存在

source: // check if we may forward the reading if (forwardingEnabled.value()) { out.collect(reading)
zh_cn: // 检查是否可以转发读数 if (forwardingEnabled.value()) { out.collect(reading)

source: // check if we need to emit an alert
zh_cn: // 检查是否需要发出警报

source: // checkpoints have to complete within five minutes, or are discarded
zh_cn: // 检查点生成必须在五分钟内完成，否则就会终止执行

source: // clear all state for the key lastTempState.clear() lastTimerState.clear()
zh_cn: // 清除当前键值的所有状态 lastTempState.clear() lastTimerState.clear()

source: // clear trigger state
zh_cn: // 清理触发器状态

source: // close resultset, statement, and connection
zh_cn: // 关闭结果集、语句及连接

source: // close writer and socket writer.close() socket.close()
zh_cn: // 关闭写入器和套接字 writer.close() socket.close()

source: // compare record timestamp with current watermark
zh_cn: // 比较记录时间戳和当前水位线

source: // compare temperature difference with threshold val tempDiff = (r.temperature - lastTemp.get).abs if (tempDiff > 1.7) {
zh_cn: // 比较温差和阈值 val tempDiff = (r.temperature - lastTemp.get).abs if (tempDiff > 1.7) {

source: // compares the temperature readings and raises alerts
zh_cn: // 来比较读数并发出警报

source: // compute average temperature using a user-defined function
zh_cn: // 使用用户自定义函数计算平均温度

source: // compute every 10 seconds the max temperature per sensor
zh_cn: // 每10秒为每个传感器计算一次最高温度

source: // compute the result from the accumulator and return it.
zh_cn: // 根据累加器计算并返回结果。

source: // compute time for next early firing by rounding watermark to second
zh_cn: // 将水位线上取整到秒来计算下一次触发时间

source: // compute timestamp of new clean up timer as record timestamp + one hour
zh_cn: // 将清理状态的计时器设置为比记录时间戳晚一小时

source: // configure a new threshold for the sensor
zh_cn: // 为指定传感器配置新的阈值

source: // configure client with host and port of queryable state proxy
zh_cn: // 利用可查询式状态代理的主机名和端口来配置客户端

source: // configure path for checkpoints on the remote filesystem
zh_cn: // 远程文件系统检查点配置路径

source: // configure the state backend
zh_cn: // 配置状态后端

source: // connect keyed sensor stream and broadcasted rules stream
zh_cn: // 联结键值分区传感数据流和广播的规则流

source: // connect readings and switches
zh_cn: // 联结读数和开关

source: // connect streams
zh_cn: // 将两条流联结

source: // connect streams with broadcast
zh_cn: // 利用广播联结数据流

source: // connect to embedded in-memory Derby
zh_cn: // 连接到嵌入式内存Derby数据库

source: // convert Fahrenheit to Celsius with an inline lambda function
zh_cn: // 使用内联lambda函数把华氏温度转为摄氏温度

source: // count readings and update results if late readings arrive
zh_cn: // 如果遇到迟到读数，则重新计数并更新结果

source: // count readings per window
zh_cn: // 计算每个窗口内的读数个数

source: // count the number of readings
zh_cn: // 计算读数个数

source: // create 1h event-time windows every 15 minutes
zh_cn: // 每隔15分钟创建1小时的事件时间窗口

source: // create 1h processing-time windows every 15 minutes
zh_cn: // // 每隔15分钟创建1小时的处理时间窗口

source: // create a DataStream[SensorReading] from a stream source
zh_cn: // 从流式数据源中创建DataStream[SensorReading]对象

source: // create a FsStateBackend that checkpoints to the /tmp/ckp folder
zh_cn: //创建一个检查点路径为/tmp/ckp的FsStateBackend

source: // create a MemoryStateBackend
zh_cn: // 创建一个MemoryStateBackend

source: // create a RocksDBStateBackend that writes incremental checkpoints
zh_cn: // 创建一个将检查点增量写入/tmp/ckp目录的RocksDBStateBackend

source: // create a configured copy of the backend
zh_cn: // 为配置后的的状态后端创建一个副本

source: // create a local stream execution environment
zh_cn: // 创建一个本地的流式执行环境

source: // create a new accumulator to start a new aggregate.
zh_cn: // 创建一个累加器来启动聚合。

source: // create a remote stream execution environment
zh_cn: // 创建一个远程的流式执行环境

source: // create and configure state backend of your choice
zh_cn: // 创建并配置所选的状态后端

source: // create and register histogram DropwizardHistogramWrapper histogramWrapper = new DropwizardHistogramWrapper(
zh_cn: // 创建并注册直方图 DropwizardHistogramWrapper histogramWrapper = new DropwizardHistogramWrapper(

source: // create configuration and set options
zh_cn: // 创建配置并设置选项

source: // create event-time session windows with a 15 min gap
zh_cn: // 创建15分钟间隔的事件时间会话窗口

source: // create keyed state descriptor
zh_cn: // 创建键值分区状态描述符

source: // create processing-time session windows with a 15 min gap
zh_cn: // 创建15分钟间隔的处理时间会话窗口

source: // create state descriptor
zh_cn: // 创建状态描述符

source: // create transaction file and writer
zh_cn: // 创建事务文件及写入器

source: // default constructor is present
zh_cn: // 提供了默认构造函数

source: // define a keyed window operator
zh_cn: // 定义键值分区窗口算子

source: // define a nonkeyed window-all operator
zh_cn: // 定义一个非键值分区的全量窗口（window-all）算子

source: // define a side output tag
zh_cn: // 定义副输出标签

source: // delete previous timer and register new timer ctx.timerService().deleteEventTimeTimer(curTimer) ctx.timerService().registerEventTimeTimer(newTimer)
zh_cn: // 删除前一个计时器并注册一个新的计时器 ctx.timerService().deleteEventTimeTimer(curTimer) ctx.timerService().registerEventTimeTimer(newTimer)

source: // direct execution context to forward result future to callback object
zh_cn: // 用于将结果Future转发给回调对象

source: // disable chaining for Map2
zh_cn: // 禁止Map2进行任务链接

source: // do not emit a watermark
zh_cn: // 不发出水位线

source: // do not fail the job on a checkpointing error
zh_cn: // 不要因为检查点生成错误导致作业失败

source: // do some cleanup, e.g., close connections to external systems
zh_cn: // 做一些清理工作，例如关闭和外部系统的连接

source: // do some initialization
zh_cn: // 进行一些初始化工作

source: // do some more processing
zh_cn: // 做一些额外处理工作

source: // e.g., establish a connection to an external system
zh_cn: // 例如和外部系统建立连接

source: // emit freezing alarm if temperature is below 32F
zh_cn: // 如果温度低于32F则发出冻结警报

source: // emit late readings to a side output
zh_cn: // 将迟到读数发至副输出

source: // emit new counters
zh_cn: // 发出新的计数器值

source: // emit update with subtask index and counter
zh_cn: // 发出由子任务索引号和数目组成的更新元组

source: // emit watermark if reading is from sensor_1
zh_cn: // 如果读数来自sensor_1则发出水位线

source: // emitting the corresponding time window
zh_cn: // 发出相应的时间窗口

source: // enable checkpoint compression
zh_cn: // 开启检查点压缩

source: // enable checkpointing with an interval of 10 seconds.
zh_cn: // 启用10秒为间隔的检查点

source: // enable queryable state and set its external identifier
zh_cn: // 启用可查询式状态并设置其外部标识符

source: // enable reading forwarding
zh_cn: // 开启读数转发

source: // event-time session windows assigner
zh_cn: // 事件时间会话窗口分配器

source: // event-time sliding windows assigner
zh_cn: // 事件时间滑动窗口分配器

source: // execute application
zh_cn: // 开始执行应用

source: // execute insert statement
zh_cn: // 执行插入语句

source: // execute insert statement if update statement did not update any row
zh_cn: // 如果数据更新条数为零则执行插入语句

source: // fetch the last temperature from state
zh_cn: // 从状态中获取上一次的温度

source: // filter for persons of age > 18
zh_cn: // 过滤出那些年龄大于18的人

source: // filter for persons with age > 18
zh_cn: // 过滤出那些年龄大于18的人

source: // filter switches enable forwarding of readings
zh_cn: // 开启读数转发的过滤开关

source: // final evaluation and purge window state
zh_cn: // 进行最终计算并清除窗口状态

source: // finalize result in ProcessWindowFunction
zh_cn: // 在ProcessWindowFunction中计算最终结果

source: // fire trigger to evaluate window
zh_cn: // 触发进行窗口计算

source: // first evaluation, emit first result out.collect((id, ctx.window.getEnd, cnt, "first")) isUpdate.update(true)
zh_cn: // 首次计算并发出结果 out.collect((id, ctx.window.getEnd, cnt, "first")) isUpdate.update(true)

source: // first stream
zh_cn: // 第一条流

source: // firstSeen will be false if not set yet
zh_cn: // 如果之前没有设置过值firstSeen为false

source: // forward all readings to the regular output
zh_cn: //将所有读数发到常规输出

source: // generate watermarks every 5 seconds
zh_cn: // 每5秒生成一次水位线

source: // generated watermark with 1 min tolerance
zh_cn: // 生成具有1分钟容忍度的水位线

source: // get broadcasted state handle
zh_cn: // 获取广播状态句柄

source: // get default parallelism
zh_cn: // 获取默认并行度

source: // get default parallelism as configured in the cluster config or
zh_cn: // 获取通过集群配置或提交客户端指定的默认并行度

source: // get previous temperature
zh_cn: // 获取前一个温度

source: // get read-only broadcast state
zh_cn: // 获取只读的广播状态

source: // get room from Derby table as Future
zh_cn: // 以Future形式从Derby表中获取房间

source: // get room if there is one
zh_cn: // 如果有剩余房间就获取一个

source: // get the CheckpointConfig from the StreamExecutionEnvironment
zh_cn: // 从StreamExecutionEnvironment中获取CheckpointConfig

source: // get threshold for sensor
zh_cn: // 获取指定传感器的阈值

source: // get timestamp of current timer
zh_cn: // 获取当前计时器的时间戳

source: // group readings in 1 hour windows with 15 min offset
zh_cn: // 将读数按照大小1小时、偏移量15分钟的时间窗口分组

source: // group readings in 1s event-time windows
zh_cn: // 将读数按照1秒事件时间窗口分组

source: // group readings in 1s processing-time windows
zh_cn: // 将读数按照1秒处理时间窗口分组
